Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 150, 150, 64)      1792      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 75, 75, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 75, 75, 64)        36928     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 38, 38, 64)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 38, 38, 128)       73856     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 19, 19, 128)       0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 46208)             0         
_________________________________________________________________
dense_5 (Dense)              (None, 128)               5914752   
_________________________________________________________________
dense_6 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_7 (Dense)              (None, 1)                 65        
=================================================================
Total params: 6,035,649
Trainable params: 6,035,649
Non-trainable params: 0
_________________________________________________________________
