Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2 (Conv2D)            (None, 150, 150, 64)      1792      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 75, 75, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 75, 75, 128)       73856     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 38, 38, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 184832)            0         
_________________________________________________________________
dense_3 (Dense)              (None, 64)                11829312  
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 65        
=================================================================
Total params: 11,905,025
Trainable params: 11,905,025
Non-trainable params: 0
_________________________________________________________________
