Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_7 (Conv2D)            (None, 150, 150, 32)      896       
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 75, 75, 32)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 75, 75, 32)        9248      
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 38, 38, 32)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 38, 38, 64)        18496     
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 19, 19, 64)        0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 23104)             0         
_________________________________________________________________
dense_8 (Dense)              (None, 128)               2957440   
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 129       
=================================================================
Total params: 2,986,209
Trainable params: 2,986,209
Non-trainable params: 0
_________________________________________________________________
